Autodesk.Revit.DB.STLExportOptions.SetTessellationSettings(Autodesk.Revit.DB.ExportResolution)
Sets all the tessellation parameters to its predefined values for the given resolution type.
resolutionType:
Type of exporting resolution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022.1

Autodesk.Revit.DB.STLExportOptions.#ctor(Autodesk.Revit.DB.ExportResolution)
Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type.
Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
resolutionType:
The type of export resolution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022.1